Revit 2027 API
FilterableValueProvider.GetDoubleValue Method
 Gets a double-precision numeric value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDoubleValue(
	Element element
)
Public Function GetDoubleValue (
	element As Element
) As Double
public:
double GetDoubleValue(
	Element^ element
)
member GetDoubleValue :
        element : Element -> float
Parameters
element Element
 The element to query.
Return Value
Double
 The double-precision numeric value from the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace